#ifndef	_INITIALIZATION_
#define _INITIALIZATION_
#include "All.h"
/****************************************************************************
Получение размера файла
****************************************************************************/
DWORD32 MyGetFileSize(HANDLE hFile);


/****************************************************************************
Инициализация байтового массива исходным кодом
****************************************************************************/
BYTE* InitializationSourseCode(CHAR *NameFile);


/****************************************************************************
Получение количества инструкций в кусочке
****************************************************************************/
DWORD32 GetNumberInstruction(BYTE*code);


/****************************************************************************
Инициализация массива структур команд
****************************************************************************/
Commands* InitializationAllCommands(BYTE* code);

/****************************************************************************
Получаем количество линейных кусочков
****************************************************************************/
DWORD32 GetNumberPieces(Commands* command);

/****************************************************************************
Исправляем  jmp-ы
****************************************************************************/
VOID CorrectionJMP(Commands* command);


/****************************************************************************
Инициализируем кусочки
****************************************************************************/
Pieces* InitializationAllPieces(Commands* command, DWORD32 Number_Pieces);
#endif