#ifndef	_OBFUSKATION_
#define _OBFUSKATION_
#include "All.h"
/****************************************************************************
Вставка мусорных команд
****************************************************************************/
Commands* InsertTrash(Commands* command);

/****************************************************************************
Вставляем мусор в кусочки
****************************************************************************/
VOID InsertTrashInPieces(Commands* command);

/****************************************************************************
Исправляем размер кусочков после обфусцирования
****************************************************************************/
VOID CountTheSize(Pieces* pieces);

VOID MixPieces(Pieces* pieces);
#endif