#ifndef	_WRITE_
#define _WRITE_
#include "All.h"
/****************************************************************************
Получаем обфусцированный код в виде байтового массива
****************************************************************************/
BYTE* RestorationCode(Pieces *pieces);

/****************************************************************************
Собираем кусочки в код и записываем его в массив
****************************************************************************/
BYTE* WriteToCode(DWORD32 size, Pieces* pieces);

/****************************************************************************
Получаем размер не обфусцированного кода
****************************************************************************/
DWORD32 GetSizeCode(Pieces* pieces);
/****************************************************************************
Запись в файл обфусцированного кода
****************************************************************************/
VOID WriteCode(BYTE* Code, CHAR *NameFile);
#endif